<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Tip;

class CreateTipsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $tips = [
            [
                'head' => 'แนะนำการลงทะเบียน',
                'detail' => 'กรณีต้องการลงทะเบียนเข้าร่วมงานแต่ไม่ส่งบทความ หรือเป็นนักวิจัยร่วม ให้เลือก "ลงทะเบียนเข้าร่วมงานทั่วไป" หากสงสัยให้ติดต่อเจ้าหน้ที่หรือผู้ดูแลระบบ',
                'image' => 'images/guide.png',
                'group' => '1'
            ],
            [
                'head' => 'แนะนำการส่งผลงาน',
                'detail' => 'เมื่อลงทะเบียนสำเร็จแล้ว ระบบจะส่งลิงก์ ไปยังอีเมลของท่านเพื่อยืนยันตัวตน จึงจะสามารถใช้ระบบส่งผลงานได้ (ผู้ที่ส่งผลงานจะต้องเลือก "ลงทะเบียนส่งผลงาน" เท่านั้น !) และจะต้องใส่ข้อมูลที่ถูกต้อง หากเกิดข้อผิดพลาดผู้ลงทะเบียน ใส่ข้อมูลมาผิด เจ้าหน้าที่จะไม่รับผิดชอบ',
                'image' => 'images/folder.png',
                'group' => '1'
            ],
            [
                'head' => 'การพิจารณาผลงาน',
                'detail' => 'พิจารณาการเลือกกลุ่มการนำเสนอ ผลงานและประเภทของการนำเสนอ ผลงาน โดยผู้ทรงคุณวุฒิจากภายใน และภายนอกมหาวิทยาลัย อย่างน้อย 2 ท่าน และคัดเลือกผลงานที่นำเสนอในการประชุม รวบรวมเป็นรายงานสืบเนื่องจากการประชุม วิชาการระดับชาติ Proceedings (ทั้งนี้บทความต้องได้รับการชำระเงินเท่านั้น..! ที่จะได้รับสิทธิ์ให้ผู้ทรงคุณวิฒิพิจารณา)',
                'image' => 'images/heart.png',
                'group' => '1'
            ],
            [
                'head' => 'การชำระเงิน',
                'detail' => '1. ผู้นำเสนอจากหน่วยงานภายนอก ที่ส่งผลงาน ค่าลงทะเบียนอัตรา 2,000 บาท ต่อ 1 ผลงาน
2. ผู้ร่วมงานทั่วไป/นิสิต/นักศึกษาจากหน่วยงานภายนอก ไม่เสียค่าใช้จ่าย
3. บุคลากรภายในมหาวิทยาลัยราชภัฏเลย ไม่เสียค่าใช้จ่าย
4. ข้าราชการหรือบุคลากรของรัฐที่เข้าร่วมประชุมสามารถเบิกจ่ายได้จากต้นสังกัดตามระเบียบของกระทรวงการคลัง
หมายเหตุ: กรณีที่ผู้สมัครเข้าร่วมงานและไม่สามารถมานำเสนอผลงานได้ สถาบันวิจัยและพัฒนา ขอสงวนสิทธิ์ ที่จะไม่คืนเงินค่าลงทะเบียนไม่ว่ากรณีใดๆ เนื่องจากต้องมีค่าใช้จ่ายในระหว่างการดำเนินงาน',
                'image' => 'images/money-exchange.png',
                'group' => '1'
            ],
        ];

        foreach ($tips as $key => $value) {
            Tip::create($value);
        }
    }
}