"use strict";

const researchGroup = [{
        "กลุ่มมนุษยศาสตร์/สังคมศาสตร์": [
            "พัฒนาชุมชนและสังคม",
            "ศิลปกรรมศาสตร์/ดนตรี",
            "นิติศาสตร์/รัฐประศาสนศาสตร์",
            "ภาษาศาสตร์/บรรณารักษศาสตร์"
        ],
    },
    {
        "กลุ่มครุศาสตร์/ศึกษาศาสตร์": [
            "วิจัยและประเมินผลการศึกษา",
            "หลักสูตรและการสอน",
            "เทคโนโลยีการศึกษา",
            "การบริหารการศึกษา",
        ],
    },
    {
        "กลุ่มวิทยาศาสตร์และเทคโนโลยี": [
            "วิทยาศาสตร์สุขภาพ",
            "วิทยาศาสตร์ชีวภาพ",
            "วิทยาศาสตร์กายภาพ",
            "วิทยาศาสตร์คอมฯ",
        ],
    },
    {
        "กลุ่มบริหารธุรกิจ การบริการ และการท่องเที่ยว": [
            "เศรษฐศาสตร์และการบัญชี",
            "บริหารธุรกิจและการจัดการ",
            "การท่องเที่ยวและการโรงแรม",
            "คอมพิวเตอร์ธุรกิจ",
            "นิเทศศาสตร์",
        ],
    },
    {
        "กลุ่มวิศวกรรม และอุตสาหกรรม": [
            "วิศวกรรมไฟฟ้า",
            "วิศวกรรมเครื่องกล",
            "วิศวกรรมอุตสาหการ",
            "วิศวกรรมและเทคโนโลยี",
        ],
    },
];
